sample_directory/system/setFieldsDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    sphereToCell
    {
        centre (0.02 0 0.10825);   //remember this are in meters
            radius 0.00125;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    
);


// ************************************************************************* //
